specters312/SVD_DUMP/Atmel/ATSAM4LC4B.svd
        <register>
          <name>PBAMASK</name>
          <description>PBA Mask</description>
          <addressOffset>0x028</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IISC</name>
              <description>IISC PB Clock Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI</name>
              <description>SPI PB Clock Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC0</name>
              <description>TC0 PB Clock Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC1</name>
              <description>TC1 PB Clock Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIM0</name>
              <description>TWIM0 PB Clock Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIS0</name>
              <description>TWIS0 PB Clock Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIM1</name>
              <description>TWIM1 PB Clock Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIS1</name>
              <description>TWIS1 PB Clock Mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART0</name>
              <description>USART0 PB Clock Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1</name>
              <description>USART1 PB Clock Mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART2</name>
              <description>USART2 PB Clock Mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART3</name>
              <description>USART3 PB Clock Mask</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCIFE</name>
              <description>ADCIFE PB Clock Mask</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DACC</name>
              <description>DACC PB Clock Mask</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACIFC</name>
              <description>ACIFC PB Clock Mask</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GLOC</name>
              <description>GLOC PB Clock Mask</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABDACB</name>
              <description>ABDACB PB Clock Mask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRNG</name>
              <description>TRNG PB Clock Mask</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PARC</name>
              <description>PARC PB Clock Mask</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CATB</name>
              <description>CATB PB Clock Mask</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIM2</name>
              <description>TWIM2 PB Clock Mask</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIM3</name>
              <description>TWIM3 PB Clock Mask</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LCDCA</name>
              <description>LCDCA PB Clock Mask</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBASEL</name>
          <description>PBA Clock Select</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PBSEL</name>
              <description>PBA Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PBDIV</name>
              <description>PBA Division Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBBMASK</name>
          <description>PBB Mask</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>HFLASHC</name>
              <description>HFLASHC PB Clock Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HCACHE</name>
              <description>HCACHE PB Clock Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HMATRIX</name>
              <description>HMATRIX PB Clock Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDCA</name>
              <description>PDCA PB Clock Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCCU</name>
              <description>CRCCU PB Clock Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBC</name>
              <description>USBC PB Clock Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEVC</name>
              <description>PEVC PB Clock Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBBSEL</name>
          <description>PBB Clock Select</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PBSEL</name>
              <description>PBB Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PBDIV</name>
              <description>PBB Division Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBCMASK</name>
          <description>PBC Mask</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <resetValue>0x0000001F</resetValue>
          <fields>
            <field>
              <name>PM</name>
              <description>PM PB Clock Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHIPID</name>
              <description>CHIPID PB Clock Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCIF</name>
              <description>SCIF PB Clock Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREQM</name>
              <description>FREQM PB Clock Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIO</name>
              <description>GPIO PB Clock Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBCSEL</name>
          <description>PBC Clock Select</description>
          <addressOffset>0x014</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PBSEL</name>
              <description>PBC Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PBDIV</name>
              <description>PBC Division Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBDMASK</name>
          <description>PBD Mask</description>
          <addressOffset>0x034</addressOffset>
          <size>32</size>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>BPM</name>
              <description>BPM PB Clock Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSCIF</name>
              <description>BSCIF PB Clock Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AST</name>
              <description>AST PB Clock Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT</name>
              <description>WDT PB Clock Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIC</name>
              <description>EIC PB Clock Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PICOUART</name>
              <description>PICOUART PB Clock Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PBDSEL</name>
          <description>PBD Clock Select</description>
          <addressOffset>0x018</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PBSEL</name>
              <description>PBD Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PBDIV</name>
              <description>PBD Division Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PPCR</name>
          <description>Peripheral Power Control Register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0x000001FE</resetValue>
          <fields>
            <field>
              <name>RSTPUN</name>
              <description>Reset Pullup</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CATBRCMASK</name>
              <description>CAT Request Clock Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACIFCRCMASK</name>
              <description>ACIFC Request Clock Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASTRCMASK</name>
              <description>AST Request Clock Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIS0RCMASK</name>
              <description>TWIS0 Request Clock Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIS1RCMASK</name>
              <description>TWIS1 Request Clock Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEVCRCMASK</name>
              <description>PEVC Request Clock Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCIFERCMASK</name>
              <description>ADCIFE Request Clock Mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREGRCMASK</name>
              <description>VREG Request Clock Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWBGREF</name>
              <description>Flash Wait BGREF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWBOD18</name>
              <description>Flash Wait BOD18</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCAUSE</name>
          <description>Reset Cause Register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>POR</name>
              <description>Power-on Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD</name>
              <description>Brown-out Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXT</name>
              <description>External Reset Pin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT</name>
              <description>Watchdog Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCDRST</name>
              <description>OCD Reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POR33</name>
              <description>Power-on Reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD33</name>
              <description>Brown-out 3.3V Reset</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x0D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CFD</name>
              <description>Clock Failure Detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCP</name>
              <description>Over Clock Detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKRDY</name>
              <description>Clock Ready</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKE</name>
              <description>Wake up</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WAKESelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Disable Interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERRDY</name>
              <description>Peripheral Ready</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>UNLOCK</name>
          <description>Unlock Register</description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Unlock Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>Unlock Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Version Register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000441</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WCAUSE</name>
          <description>Wake Cause Register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TWI_SLAVE_0</name>
              <description>Two-wire Slave Interface 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TWI_SLAVE_1</name>
              <description>Two-wire Slave Interface 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USBC</name>
              <description>USB Device and Embedded Host Interface</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSOK</name>
              <description>Power Scaling OK</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD18_IRQ</name>
              <description>BOD18 Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33_IRQ</name>
              <description>BOD33 Interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PICOUART</name>
              <description>Picopower UART</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LCDCA</name>
              <description>LCD Controller</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EIC</name>
              <description>External Interrupt Controller</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AST</name>
              <description>Asynchronous Timer</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
